/*
*********************************************************************************************************
*
*	模块名称 : 中断模块
*	文件名称 : stm8s_it.c
*	版    本 : V2.1.0
*	说    明 : 本文件存放所有的中断服务函数，为了便于他人了解程序用到的中断，我们不建议将中断函数移到其他
*			的文件。
*				这是ST公司做的源代码，我们只是进行了格式整理。
*
*	Copyright (C), 2012-2013, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "stm8s_it.h"

/*
	友情提示：

	不同的编译器申明中断函数的表达方式不同，STM8固件库为了同时兼容几种编译器，在 stm8s.h 文件中定义
一个关键的宏 ： INTERRUPT_HANDLER 来统一源代码。

	以下代码摘自 stm8s.h 文件
	#ifdef _COSMIC_
	 #define INTERRUPT_HANDLER(a,b) @far @interrupt void a(void)
	 #define INTERRUPT_HANDLER_TRAP(a) void @far @interrupt a(void)
	#endif

	#ifdef _RAISONANCE_
	 #define INTERRUPT_HANDLER(a,b) void a(void) interrupt b
	 #define INTERRUPT_HANDLER_TRAP(a) void a(void) trap
	#endif

	#ifdef _IAR_
	 #define STRINGVECTOR(x) #x
	 #define VECTOR_ID(x) STRINGVECTOR( vector = (x) )
	 #define INTERRUPT_HANDLER( a, b )  \
	 _Pragma( VECTOR_ID( (b)+2 ) )        \
	 __interrupt void (a)( void )
	 #define INTERRUPT_HANDLER_TRAP(a) \
	 _Pragma( VECTOR_ID( 1 ) ) \
	 __interrupt void (a) (void)
	#endif


	ST公司为了统一源代码，将不同型号的STM8系列CPU的中断服务程序全部加进来了，不同子系列的CPU包含不同的中断,
	大家可以根据#if 这些条件编译来识别哪些中断服务程序是有效的。

	对于安富莱 STM8S103F3-EK 开发板板，CPU型号为 STM8S103F3P6， 它属于 STM8S103 类。有效的中断如下：

		TRAP_IRQHandler						TRAP 软件中断
		TLI_IRQHandler						外部最高级中断
		AWU_IRQHandler						自动唤醒中断
		CLK_IRQHandler						时钟控制器中断
		EXTI_PORTA_IRQHandler				外部端口A中断
		EXTI_PORTB_IRQHandler				外部端口B中断
		EXTI_PORTC_IRQHandler				外部端口C中断
		EXTI_PORTD_IRQHandler				外部端口D中断
		EXTI_PORTE_IRQHandle				外部端口E中断 (由于只有20引脚，该端口并未引出)
		SPI_IRQHandlerr						SPI中断
		TIM1_UPD_OVF_TRG_BRK_IRQHandler		TIM1中断（更新\溢出\触发\终止）
		TIM1_CAP_COM_IRQHandler				TIM1中断（捕获\比较）
		TIM2_UPD_OVF_BRK_IRQHandler			TIM2中断（更新\溢出\触发\终止）
		TIM2_CAP_COM_IRQHandler				TIM2中断（捕获\比较）
		UART1_TX_IRQHandler					UART1发送中断（捕获\比较）
		UART1_RX_IRQHandler					UART2接收中断（捕获\比较）
		I2C_IRQHandler						I2C中断
		ADC1_IRQHandler						ADC1中断
		TIM4_UPD_OVF_IRQHandler				TIM4更新溢出中断
		EEPROM_EEC_IRQHandler				编程结束/禁止编程

*/


/* Cosmic 编译器需要的 */
#ifdef _COSMIC_
	/*
	*********************************************************************************************************
	*	函 数 名: NonHandledInterrupt
	*	功能说明: 哑中断
	*	形    参：无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(NonHandledInterrupt, 25)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*_COSMIC_*/

/*
*********************************************************************************************************
*	函 数 名: TRAP_IRQHandler
*	功能说明: TRAP 软件中断服务程序
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER_TRAP(TRAP_IRQHandler)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: TLI_IRQHandler
*	功能说明: 外部最高级中断服务程序  Top Level Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(TLI_IRQHandler, 0)

{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: AWU_IRQHandler
*	功能说明: 自动唤醒中断服务程序  Auto Wake Up Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(AWU_IRQHandler, 1)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: CLK_IRQHandler
*	功能说明: 时钟控制器中断服务程序  Clock Controller Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(CLK_IRQHandler, 2)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: EXTI_PORTA_IRQHandler
*	功能说明: 外部端口A中断  External Interrupt PORTA Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(EXTI_PORTA_IRQHandler, 3)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: EXTI_PORTB_IRQHandler
*	功能说明: 外部端口B中断服务程序  External Interrupt PORTB Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(EXTI_PORTB_IRQHandler, 4)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: EXTI_PORTC_IRQHandler
*	功能说明: 外部端口C中断服务程序  External Interrupt PORTC Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(EXTI_PORTC_IRQHandler, 5)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: EXTI_PORTD_IRQHandler
*	功能说明: 外部端口D中断服务程序  External Interrupt PORTD Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(EXTI_PORTD_IRQHandler, 6)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: EXTI_PORTE_IRQHandler
*	功能说明: 外部端口E中断服务程序  External Interrupt PORTE Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(EXTI_PORTE_IRQHandler, 7)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

#ifdef STM8S903
	/*
	*********************************************************************************************************
	*	函 数 名: EXTI_PORTF_IRQHandler
	*	功能说明: 外部端口F中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(EXTI_PORTF_IRQHandler, 8)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S903*/

#if defined (STM8S208) || defined (STM8AF52Ax)

	/*
	*********************************************************************************************************
	*	函 数 名: CAN_RX_IRQHandler
	*	功能说明: CAN Rx 中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(CAN_RX_IRQHandler, 8)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: CAN_TX_IRQHandler
	*	功能说明: CAN Tx 中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(CAN_TX_IRQHandler, 9)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S208 || STM8AF52Ax */

/*
*********************************************************************************************************
*	函 数 名: SPI_IRQHandler
*	功能说明: SPI 中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(SPI_IRQHandler, 10)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: TIM1_UPD_OVF_TRG_BRK_IRQHandler
*	功能说明: TIM1 中断服务程序  Timer1 Update/Overflow/Trigger/Break Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(TIM1_UPD_OVF_TRG_BRK_IRQHandler, 11)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/*
*********************************************************************************************************
*	函 数 名: TIM1_CAP_COM_IRQHandler
*	功能说明: TIM1 捕获/比较中断服务程序 Timer1 Capture/Compare Interrupt routine.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(TIM1_CAP_COM_IRQHandler, 12)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

#ifdef STM8S903
	/*
	*********************************************************************************************************
	*	函 数 名: TIM5_UPD_OVF_BRK_TRG_IRQHandler
	*	功能说明: TIM5中断服务程序 Timer5 Update/Overflow/Break/Trigger Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM5_UPD_OVF_BRK_TRG_IRQHandler, 13)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: TIM5_UPD_OVF_BRK_TRG_IRQHandler
	*	功能说明: TIM5中断服务程序 Timer5 Update/Overflow/Break/Trigger Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM5_CAP_COM_IRQHandler, 14)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

#else /*STM8S208, STM8S207, STM8S105 or STM8S103 or STM8AF62Ax or STM8AF52Ax or STM8AF626x */
	/*
	*********************************************************************************************************
	*	函 数 名: TIM2_UPD_OVF_BRK_IRQHandler
	*	功能说明: TIM2中断服务程序 Update/Overflow/Break Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM2_UPD_OVF_BRK_IRQHandler, 13)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: TIM2_CAP_COM_IRQHandler
	*	功能说明: TIM2捕获/比较中断服务程序  Timer2 Capture/Compare Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM2_CAP_COM_IRQHandler, 14)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S903*/

#if defined (STM8S208) || defined(STM8S207) || defined(STM8S007) || defined(STM8S105) || \
    defined(STM8S005) ||  defined (STM8AF62Ax) || defined (STM8AF52Ax) || defined (STM8AF626x)
	/*
	*********************************************************************************************************
	*	函 数 名: TIM3_UPD_OVF_BRK_IRQHandler
	*	功能说明: TIM3中断服务程序  Timer3 Update/Overflow/Break Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM3_UPD_OVF_BRK_IRQHandler, 15)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: TIM3_CAP_COM_IRQHandler
	*	功能说明: TIM3中捕获/比较中断服务程序   Timer3 Capture/Compare Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM3_CAP_COM_IRQHandler, 16)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S208, STM8S207 or STM8S105 or STM8AF62Ax or STM8AF52Ax or STM8AF626x */

#if defined (STM8S208) || defined(STM8S207) || defined(STM8S007) || defined(STM8S103) || \
    defined(STM8S003) ||  defined (STM8AF62Ax) || defined (STM8AF52Ax) || defined (STM8S903)
	/*
	*********************************************************************************************************
	*	函 数 名: UART1_TX_IRQHandler
	*	功能说明: UART1发送中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(UART1_TX_IRQHandler, 17)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: UART1_RX_IRQHandler
	*	功能说明: UART1接收中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(UART1_RX_IRQHandler, 18)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S208 or STM8S207 or STM8S103 or STM8S903 or STM8AF62Ax or STM8AF52Ax */

/*
*********************************************************************************************************
*	函 数 名: I2C_IRQHandler
*	功能说明: I2C中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(I2C_IRQHandler, 19)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

#if defined(STM8S105) || defined(STM8S005) ||  defined (STM8AF626x)
	/*
	*********************************************************************************************************
	*	函 数 名: UART2_TX_IRQHandler
	*	功能说明: UART2发送中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(UART2_TX_IRQHandler, 20)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: UART2_RX_IRQHandler
	*	功能说明: UART2接收中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(UART2_RX_IRQHandler, 21)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /* STM8S105 or STM8AF626x */

#if defined(STM8S207) || defined(STM8S007) || defined(STM8S208) || defined (STM8AF52Ax) || defined (STM8AF62Ax)
	/*
	*********************************************************************************************************
	*	函 数 名: UART3_TX_IRQHandler
	*	功能说明: UART3发送中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(UART3_TX_IRQHandler, 20)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}

	/*
	*********************************************************************************************************
	*	函 数 名: UART3_RX_IRQHandler
	*	功能说明: UART3接收中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(UART3_RX_IRQHandler, 21)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S208 or STM8S207 or STM8AF52Ax or STM8AF62Ax */

#if defined(STM8S207) || defined(STM8S007) || defined(STM8S208) || defined (STM8AF52Ax) || defined (STM8AF62Ax)
	/*
	*********************************************************************************************************
	*	函 数 名: ADC2_IRQHandler
	*	功能说明: ADC2 中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(ADC2_IRQHandler, 22)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#else /*STM8S105, STM8S103 or STM8S903 or STM8AF626x */
	/*
	*********************************************************************************************************
	*	函 数 名: ADC1_IRQHandler
	*	功能说明: ADC1 中断服务程序
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(ADC1_IRQHandler, 22)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#endif /*STM8S208 or STM8S207 or STM8AF52Ax or STM8AF62Ax */

#ifdef STM8S903
	/*
	*********************************************************************************************************
	*	函 数 名: TIM6_UPD_OVF_TRG_IRQHandler
	*	功能说明: TIM6 中断服务程序  Timer6 Update/Overflow/Trigger Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	INTERRUPT_HANDLER(TIM6_UPD_OVF_TRG_IRQHandler, 23)
	{
		/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
	}
#else /*STM8S208, STM8S207, STM8S105 or STM8S103 or STM8AF52Ax or STM8AF62Ax or STM8AF626x */
	/*
	*********************************************************************************************************
	*	函 数 名: TIM4_UPD_OVF_IRQHandler
	*	功能说明: TIM4 中断服务程序  Timer4 Update/Overflow Interrupt routine.
	*	形    参: 无
	*	返 回 值: 无
	*********************************************************************************************************
	*/
	extern void SysTick_ISR(void);
	INTERRUPT_HANDLER(TIM4_UPD_OVF_IRQHandler, 23)
	{
        SysTick_ISR();
	}
#endif /*STM8S903*/

/*
*********************************************************************************************************
*	函 数 名: EEPROM_EEC_IRQHandler
*	功能说明: Eeprom EEC 中断服务程序  编程结束/禁止编程
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
INTERRUPT_HANDLER(EEPROM_EEC_IRQHandler, 24)
{
	/* 在开发阶段为了检测出程序异常，推荐在此处设置断点 */
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
